OpenFOAM/freeSurfaceFlows-0Fv1812/cases/spillway-2.2/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.16e-4;

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform 2.16e-4;
    }
    
    inletWater
    {
        type            fixedValue;
        value           uniform 2.16e-4;
    }

    outlet
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 2.16e-4;
        value           uniform 2.16e-4;
    }

    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 2.16e-4;
    }
    
    dam_Mesh
    {
        type            kqRWallFunction;
        value           uniform 2.16e-4;
    }
    
    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
    
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
